export const constants = {
  WELCOME: `سلام به ربات حاضر جواب خوش اومدی 😍 
برای شروع میتونی از گزینه های موجود در منو استفاده کنی
و با مراجعه به کانال تلگرام حاضرجواب سوال خودتون رو مشاهده کنی
در نهایت اگه از جواب کسی خوشت اومد اون رو با تگ #جواب ریپلای کن`,
  USE_MENU: "خانه 🏠",
  WRITE_Q: "متن چت طرفتون رو بنویسید و سپس گزینه ارسال رو بزنید",
  // menu main
  M_ASK_Q: "➕ پرسیدن یک سوال جدید",
  M_MY_QS: "❔ لیست سوال هام",
  M_MY_AS: "❕ لیست جواب هام",
  M_PROFILE: "👤 پروفایل",
  M_HELP: "ℹ️ راهنما",
  M_CREDIT: "🪙 سکه",
  M_INVITE: "🫂 معرفی به دوستان (سکه رایگان) 💰",
  // question
  Q_SEND: "✔️ ارسال",
  Q_CANCEL: "❌ لغو",
};
